{
    "links": [
        "https://br.pinterest.com/pin/levi-ackerman-snk-icon--225672631318869503/",
        "https://en.wikipedia.org/wiki/Levi_Ackerman#:~:text=Levi%20Ackerman%20%28%E3%83%AA%E3%83%B4%E3%82%A1%E3%82%A4%E3%83%BB%E3%82%A2%E3%83%83%E3%82%AB%E3%83%BC%E3%83%9E%E3%83%B3%2C%20Livai%20Akk%C4%81man%2C%20alt.%20%22Levi%20Ackermann%22%29,Hajime%20Isayama%20%27s%20manga%20series%20Attack%20on%20Titan."
    ],
    "data": [
        {
            "url": "https://br.pinterest.com/pin/levi-ackerman-snk-icon--225672631318869503/",
            "data": [],
            "img_links": [
                "https://i.pinimg.com/736x/8b/1a/d9/8b1ad9e3d0f12324a0ff496760ecd20f.jpg",
                "https://i.pinimg.com/75x75_RS/76/3f/1d/763f1de077478dfa92c88c28b26af2ad.jpg"
            ]
        },
        {
            "url": "https://en.wikipedia.org/wiki/Levi_Ackerman#:~:text=Levi%20Ackerman%20%28%E3%83%AA%E3%83%B4%E3%82%A1%E3%82%A4%E3%83%BB%E3%82%A2%E3%83%83%E3%82%AB%E3%83%BC%E3%83%9E%E3%83%B3%2C%20Livai%20Akk%C4%81man%2C%20alt.%20%22Levi%20Ackermann%22%29,Hajime%20Isayama%20%27s%20manga%20series%20Attack%20on%20Titan.",
            "data": [
                "\n",
                "Levi Ackerman (リヴァイ・アッカーマン, Livai Akkāman, alt. \"Levi Ackermann\") is a fictional character from Hajime Isayama's manga series Attack on Titan. Levi is a soldier working for the Survey Corps Special Operations Squad (調査兵団特別作戦班, Chōsa Heidan Tokubetsu Sakusen-han), also known as Squad Levi (リヴァイ班, Rivai-han),  a squad of four elite soldiers with impressive combat records hand-picked by him. The squad takes the protagonist Eren Yeager under their wing as both his bodyguards and potential executors if he goes berserk. Though Levi is a supporting character, his backstory is explored when dealing with his former mentor Kenny during the main series as well as in the spin-off manga Attack on Titan: No Regrets.\n",
                "Levi was based on the Watchmen character Rorschach, among other influences. In the anime adaptation of the series, Levi is voiced by Hiroshi Kamiya in Japanese and Matthew Mercer in English. His portrayal in No Regrets did not display major differences in characterization despite acting as his backstory.\n",
                "Critical response to Levi Ackerman's character was widely  acclaimed  for his supporting role with the main cast and most notably, his relationship with Kenny. Levi's popularity led him to win several awards and polls. His role in the prequel No Regrets also attracted generally positive reception for expanding his backstory.\n",
                "Levi was modeled by manga author Hajime Isayama after the Watchmen character Rorschach[1] and is named after a child Isayama noticed in the documentary Jesus Camp.[2]  Isayama has noted that he gave Levi a similar stature to Rorschach and gave him an obsession with cleanliness to contrast him with Rorschach's uncleanliness.[3] Isayama stated that Mikasa, Levi, and Kenny are all part of the same Ackerman bloodline. However, their reasons for protecting their respective counterparts do not have anything to do with the bloodline itself—\"it is just their nature.\"[4] Before\tHikaru Suruga began the manga Attack on Titan: No Regrets, her editor-in-chief suggested that she visit the Metropolitan Area Outer Underground Discharge Channel so she could better visualize the Underground where Levi and the others live at the beginning of the story. [vol. 1]: 162  While drawing Levi, Suruga attempted to make him appear younger than he does in Attack on Titan. She noted that his lack of emotiveness made it difficult to choose which expressions to give him while drawing.[vol. 1]: 182 \n",
                "Levi is voiced by Hiroshi Kamiya[5] and by Matthew Mercer in the English dub.[6] Kamiya describes his character as \"stoic and cool\", a germaphobe and \"humanity’s strongest soldier\", making his character popular even before anime's debut. When he was given Levi's role, the actor expressed pressure. Despite the character's popularity, nobody in the staff knew about his backstory making him hard to approach. After consulting Director Tetsuro Araki and composer Masafumi Mima, Kamiya learnt that Levi was not as superhuman as he imagined him to be; As a result, Kamiya studied the action scenes and expression Levi makes in the series in order to properly display his emotions. By the anime's third season, Kamiya liked the fact that Levi's mentor Kenny was introduced in the narrative as the connection these two share made Levi easier to understand more. Kamiya befriended Kenny's actor Yamaji Kazuhiro in order to explain their misrelationship as they are meant to fight. As a result, Kamiya believes that Levi became a more popular character thanks to the story of the third season.[7]\n",
                "Matthew Mercer was a fan of Attack on Titan before being cast for the English dub of the series. He came to regard Levi as his favorite character, especially due to his moral ambiguity; According to Mercer, while Levi is known as the strongest fighter in mankind's fight against the Titans, he is often forced to take dark decisions in order to survive. Mercer stated it was \"an absolute joy to perform this extremely complicated, dark, intense, and still kind of heroic character\".[8]\n",
                "Levi is known as humanity's most powerful soldier and head of an elite squad in the Survey Corps. Hange remarks that he is a bit of a \"clean freak\".[9] Captain Kenny Ackerman later notes that the capture of Eren and Historia has to do with Levi, whom he refers to as \"Levi Ackerman\".[ch. 56] Kenny is later revealed to be Levi's maternal uncle, who raised him after his mother Kuchel's death. Later, Levi is injured by an explosion engineered by Zeke Yeager (brother of Eren Jaeger). He was in a near-death state until Hange Zoe found him and escaped with his body later to make an alliance with Commander Theo Magath and Pieck Finger in order to take down Eren Jaeger. Eventually, Levi recovers and joins the others in battle, managing to kill Zeke, fulfilling his promise to Erwin in killing the Beast Titan.\n",
                "Levi was part of a band of thieves alongside his partner Furlan Church, who would use maneuver gear to commit various heists to help each other out. One day, they meet a girl named Isabel Magnolia, who was chased after by guards for trying to get an injured bird back to the surface, and decide to take her in as one of their group. After a while has passed, a mysterious man from the surface uses a hostage to ensure Levi, Furlan, and Isabel take on a job that would be rewarded with citizenship on the surface. When the three take on the job, they outrun the military police but are arrested by the Survey Corps, led by Erwin, who offers to clear Levi and the others of their crimes in exchange for joining the Survey Corps.\n",
                "Levi, Furlan, and Isabel begin their lives in the Survey Corps under the watch of Flagen, who is less than pleased about being joined by criminals, all while recalling the mysterious man's request to kill Erwin and steal one of his documents. Unable to find the document in Erwin's office, the group come up with a plan to ambush Erwin during an expedition, which Levi initially plans to do by himself but is inevitably convinced by Furlan and Isabel to let them come with him. On the day of the expedition, the Survey Corps encounter a group of Titans, which Levi's group manage to help eliminate only to be scolded by Erwin for wasting gas. Later, Levi decides to make use of a heavy rainfall to get close to Erwin, but when he returns, he discovers Titans had ambushed and killed the rest of his squad, including Furlan and Isabel. This causes Levi to unleash erratic emotions on the last titan remaining. After learning that Erwin was carrying a fake document the entire time and his mission was meaningless, Levi, taught not to have regrets, decides to continue following Erwin as a Survey Corps member.\n",
                "Jin Haganeya's visual novel Burning Bright in the Forests of the Night has Eren and Levi as the leading characters. He also appears in the mobile game Granblue Fantasy.[10]  He also features as an in-game outfit in the Battle Royale game, Fortnite.[11] Levi's costume also showed up as limited time purchasable skins for Jake Park in Dead by Daylight and Daniel Yatsu in Call of Duty: Vanguard.[12][13] Levi, together with Eren and Mikasa, featured in an epic collaboration of Mobile Legends: Bang Bang and the anime in January 2024[14] with Levi appears as a skin for Martis.[15]\n",
                "In the 3rd Newtype Anime Awards, Levi was voted fifth best male character and Hiroshi Kamiya took 2nd place in best voice actor.[16] In the Animedia Character Awards he was third in Most Valuable Player.[17][18] In the 36th Anime Grand Prix he was Best Male Character[19][20] In the 3rd BTVA Anime Dub Awards Matthew Mercer was nominated for Levi.[21] In the 7th Newtype Anime Awards he was fifth in Best Male Character.[22]\n",
                "In the Funimation's Decade of Anime fan poll, Levi was voted as one of the five recipients for the \"Best Boys of the Decade\" category.[23] In the 4th Crunchyroll Anime Awards, his fight against the Beast Titan was nominated.[24][25] Multiple types of merchandising have been developed with the fandom enjoying the facial expressions given to his figurines.[26]\n",
                "During a review of the first season, Complex.com saw Levi as \"hope\" within the Attack on Titan anime as he easily kills Titans on his own after seeing an episode where the protagonist Eren is eaten by them in horror. Complex compared Levi to Daryl Dixon. However, when Eren is revealed to be a Titan who easily beats up other enemy Titans, he found that Levi's spotlight was overshadowed by Eren's screentime.[27] Levi's encounter with Kenny was also the subject of praise for the fight choreography and expanding more on Levi's backstory.[28] Anime News Network also praised Mercer's voice acting for making Levi's character appeal to the audience.[29] The tragic nature of Levi and Kenny's relationship was praised for how it was handled as well as the end of their fights in the series' third season.[30] Following the ending of season 3, Den of Geek looked forward to Levi's actions in the final story arc as whether or not he can kill Eren as a result of change of the status quo.[31] Comic Book Resources enjoyed Levi's fight scenes, dedicating an article to his ten best battles in the series with his battle against Zeke taking top place.[32]\n",
                "Reviewing the first volume of No Regrets for The Fandom Post, Kate O'Neil noted Levi's status as a fan-favorite character, she wrote: \"I often wonder at how much of the backstory in these spinoffs was the result of the original author's notes or the spinoff writer responding to the desires of the fanbase.\" while also addressing the story he shares with Erwin.[33] Anime News Network found the OVA adaptation worth watching if the viewers are fans of Levi.[34] While revisiting the episodes, the website noted that Levi's backstory and his relationship with other characters help in establishing his characterization from the main series.[35] While noting that Levi shared little changes between the OVAs and the main series, UK Anime Network felt the spin-off is interesting at developing his relationship with Erwin and the motivation of living in a better style after being hidden underground. He still noted that Levi was one of the best protagonists in the entire franchise, surpassing Eren, Mikasa and Armin.[36] On the other hand, another writer found Levi's backstory confusing as he found no need to see his OVAs to understand more of the series' lore or character relationships.[37]\n",
                "Attack on Titan manga volumes by Hajime Isayama. Original Japanese version published by Kodansha. English version by Kodansha USA.\n"
            ],
            "img_links": [
                "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg",
                "https://upload.wikimedia.org/wikipedia/en/4/4b/Leviackerman.png",
                "https://upload.wikimedia.org/wikipedia/commons/thumb/2/27/Matthew_Mercer_by_Gage_Skidmore.jpg/170px-Matthew_Mercer_by_Gage_Skidmore.jpg",
                "https://login.wikimedia.org/wiki/Special:CentralAutoLogin/start?useformat=mobile&type=1x1&usesul3=0",
                "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg"
            ]
        }
    ]
}