{
    "links": [
        "https://myotakuworld.com/best-hentai-anime/"
    ],
    "data": [
        {
            "url": "https://myotakuworld.com/best-hentai-anime/",
            "data": [
                "Everyone discusses the latest and most interesting new series each season. ",
                "Sometimes, what is left off the radar is the new best hentai series.",
                "Hentai isn’t a top story for several reasons. But the newest hentai is still fantastic, though.",
                "Our top hentai list has been updated. With some of the greatest picks, you can watch.",
                "“Hentai” is a vast genre with several subgenres to satisfy all preferences.",
                "Without further ado, here is the most popular Hentai.",
                "Table of Contents",
                "Shinobu Honda is in love with Momoko Naito, a childhood friend she has known since she was a child.",
                "But Momoko is a member of their high school’s morality police and isn’t very interested.",
                "Shinobu makes the best of her situation and builds up a harem of girls with whom she has frequent passionate relationships.",
                "But in the last episode, her patience pays off, and she gets to show Momoko what she can do in bed.",
                "Each character in this hentai anime series has an interesting backstory, and the sex scenes could only have been written by a lesbian expert.",
                "If you watch this yuri hentai, you’ll be so blown away that the only thing you’ll want to do tomorrow has a threesome with the closest lesbian girls.",
                "Does c*m have the power to save the world? Well, in Isekai Harem Monogatari, the answer is definitely yes!",
                "A 16-year-old fap addict named Naoki Oikawa is shown. He wanks so often that his right hand might as well reach his toes.",
                "One day, while he is playing with his woody, he is taken to a fantasy world where he meets a priestess, an elf, and a swordswoman.",
                "The three tell him that an evil being called the Demon King will destroy their world, and the only way to stop this is for him to give them his s*men, which gives them strength and makes their magic stronger.",
                "Our young boy works without complaining, filling c*nts and gullets.",
                "The story is all about Tanaka Hajime’s hypnotic powers, which help him get all the poontang he wants and more.",
                "He gets himself hired as a sex counselor because the law says that all couples need to take lessons from someone like him before they can get intimate or even just kiss.",
                "Obata Yui and Tachibana Daiki go to Tanaka for help because the law says they have to.",
                "Daiki is smart enough to watch as Tanaka stabs Yui with his dick and breaks her hymen.",
                "We hope that he learned enough from the master to be able to give Yui all the c*m she will ever need.",
                "This top hentai anime is based on a visual novel and is just as exciting as a virgin snatch for the first person who sees it.",
                "A guy named Sakonji Seiichi is at the center of the story. The lucky guy lives next door to a beautiful, classy, and smart woman named Sanjou Maki.",
                "She decides to jerk off on her veranda one day, and Sakonji is there to see it.",
                "They talk, and she decides to be his s*x slave and enjoy his straight-as-f*ck woody regularly.",
                "They have a lot of sex in public, and in the second episode, Sakonji gets to fill a new hussy.",
                "Maki-chan to Now is one of the best-animated shows out there, and the sex scenes could teach a satyr a thing or two.",
                "Daisuke Ichijou wants to relax, so he goes to his grandmother’s beach resort. The place is full of beautiful, h*rny girls who could use some c*ck in their nether regions.",
                "Daisuke soon starts to f*ck everything with a slit, but he leaves his grandmother alone, which is a good thing.",
                "The girls he meets swoon over him, fight over him, and give him all the tough love he needs.",
                "What a nice vacation Daisuke has had, and what a good workout for his c*ck!",
                "Resort Boin has simple action but great animation, so it doesn’t hold back and hits like a beast.",
                "The story starts when a vampire student named Mari Setogaya sends a letter to a student named Kanzaki. ",
                "The letter asks for a meeting. Mari attacks Kanzaki with all her strength, but she can’t knock him out and eat his blood.",
                "She tells her lucky victim about life, and he feels bad for her and lets her bite him. ",
                "Mari doesn’t like the taste of blood, though, so Kanzaki feeds her with his crotch instead, which makes her breasts bigger by accident.",
                "Mari even has tiny wings, and if you touch them while you’re f*cking her, your 0rg*sms will go off the charts. She tells him she loves him, but it looks like he’s just a great lie to her. Poor lad!",
                "Even though it’s only the end of November, the falling snow has already turned the hot springs town of Yomase-machi into a winter wonderland.",
                "Yuuki moved to this snowy town to help his grandparents clear snow from their house, which used to be a boarding house.",
                "He met a lot of kind people, like the shrine maiden Sayuki, who worries that she doesn’t know how to properly greet strangers. ",
                "He also met his mysterious housemate and senpai Mizuki, who was a lot of fun, and the happy and energetic kouhai mascot at the local café, Koharu.",
                "Even though he still felt lost, he tried to get used to living in this snowy land.",
                "At that time, his grandfather told him to find love while he was still young and start a new life.",
                "He should take the first step and fall in love now.",
                "Half a year after his father remarried, Naoto Takahashi still hasn’t gotten used to his stepmother Sachiko and his new little sister Yui.",
                "One night as he tries to figure out how to smooth things over with his sister, he gets an app to allow him to take over someone else’s body.",
                "This certainly makes this interesting.",
                "Morishita Wataru grew up in a motherless family but worked hard to enroll in Ousei Academy.",
                "The school’s ratings are related to the teacher’s evaluation, thus teachers provide students a strict education.",
                "Morishita’s grades were below average in a class of brilliant students. His homeroom teacher Tsukishima Kyoko was harsh on him regarding his grades and daily life. ",
                "Morishita was burdened by rigorous studies and harsh teaching, but his assistant homeroom teacher, Shirakawa Miwa, a kind woman, was always on his mind.",
                "Morishita lost his main moral support when she suddenly announced her marriage. ",
                "Naturally, he couldn’t focus on his studies and got the lowest mark on the scholarship test, resulting in after-school special classes.",
                "Now that his admired Miwa was going to be someone else’s woman, he was more stressed than ever. ",
                "When his phone vibrated, he checked it out of curiosity and saw an app called “Hypnosis app”",
                "A student who lives alone during the summer because of problems with his family runs into a classmate at a convenience store.",
                "Her name is Shiinea Chieri, but everyone calls her “Chii-chan.” She has big breasts, a good body, and is very open about her s*xuality and adventures.",
                "It seems unlikely that I’ll be with her, but then she smiles…",
                "The story takes place in a small town in the country.",
                "Kouta is the only son and heir to the Mikomori shrine in the small, redeveloping town of Tsumagoi-chou, which had been losing popularity. ",
                "He wasn’t interested in taking over the shrine. Instead, he worked hard at school because he wanted to work for the government after he graduated.",
                "His father talked about marrying a young girl after he lost his wife, but then he just vanished.",
                "That girl, Erina, and her younger sister, Motoka, moved in with him.",
                "They were able to keep living normal lives with the help of his childhood friend Mio and a few shrine supporters.",
                "One day, Erina brought home a girl named Mai, who said she was his fiancée.",
                "Things went from bad to worse until Erina told him to get her pregnant.",
                "Akito Natsuki decides to spend his one-month summer vacation in his hometown because his place of work is closed for repairs.",
                "He decides to take it easy because he has no money and nothing to do.",
                "Sayoko, who always treated him like her own son, and his sister-in-law, Miyuri, were waiting for him at home.",
                "As usual, Akito tried to hide how he felt and played the role of the brother-in-law. However, after a slip of the tongue, his true feelings came out.",
                "Then, his relationships with Miyuki and Sayoko, which had been stuck, start to move forward again, and he eventually gets very close to both of them.",
                "To deal with the serious problem of unemployment, the government has started a special program to force young people who can’t find work or who failed high school to work. ",
                "These people are called “dropouts.”",
                "At first, this was just simple manual labor, but soon girls who had dropped out of school were forced to give men s*xual services.",
                "Since how well you did in school determines which dropout you get, men all over the country are in a fierce battle to find the best s*x partners.",
                "Ryouta Niimi gets an award for being the best Japanese dropout at the top of his school.",
                "Reika Shichijou, who used to like him, is now his “study partner.”",
                "Niimi’s classmates soon start to envy him because he was given such a sweet and attractive girl.",
                "How did Reika, who used to be a model student, end up in this humiliating and subservient role, and why is she enjoying it so much?",
                "Spring has come again to Tokyo, but this year you are living on your own because your parents had to leave for work. ",
                "Your aunt runs an apartment where you rent a room, and she asks you straight out, “Could it be that you’re not interested in girls?” ",
                "Well, you should be! Just that you haven’t been able to find anyone “This is your youth. ",
                "To find love, or you’ll regret it in the future.” With just that little push, you start to feel like it’s time for you to fall in love.",
                "Your love will start to grow now, yes…",
                "Kiyoshi Tachikawa owns and runs a candy shop in a small town outside of Tokyo.",
                "He quit his old job to get away from the noise of a big city. Now, he spends his days with little girls and enjoys it.",
                "Chie Sayama, Tenka Adachi, and Komako S*menovich are three girls who often stop by Kiyoshi’s shop.",
                "Because he is friendly and easygoing, the not-so-good girls quickly become interested in Kiyoshi and want him to help them with their problems.",
                "Soon, they fall in love with him and are happy to leave their bodies in his care while they enjoy s*xual pleasures in his home.",
                "Alfheim is an elf world where only women live. The world Shrine, which is where all the elves’ magical power comes from, has started to lose its power, and the race was in danger of going extinct.",
                "Then, there is a prophecy that says a man from a different world will save the elves. And it didn’t take long before the hero was taken to the world of elves…",
                "The elves decided that they could only stay alive if they had children with the hero. ",
                "But many of the other elves didn’t agree with this stupid idea, so the elves split into two groups: those who didn’t like the idea of having a child with a man and those who were willing to accept it.",
                "But those who agreed have found out something: if they have s*x with the hero and get his sperm into their bodies, their magic powers get stronger. So they proceed to milk him dry…",
                "It doesn’t look like Mai Sawaguchi and Reo Kawamura are friends. Even though Mai tries to get along with Reo all the time, they always end up fighting.",
                "But when Mai asks Reo if she hates her or not, Reo ends up telling the truth instead.",
                "Mai starts to wonder if she feels the same way. She is confused and surprised. When she sees Reo again after school, she is ready to answer.",
                "When the two girls agree that they feel the same way about each other, they start using each other to satisfy their s*xual needs.",
                "Kazuma Shiraishi is stuck on an uninhabited island somewhere in the Pacific after a storm.",
                "But his situation might not be so bad, since he is stuck on an island with 15 beautiful women.",
                "Kazuma jumps at the chance to have s*x with these women. He uses the three cameras he found on the beach to record his dirty deeds.",
                "At the school Joshikousei no Koshitsuki, seduction, and s*xuality seem to be in the air, water, or both.",
                "The beach volleyball coach at the institute got the biggest surprise of his life when the attractive and h*rny Saori Kiryuu asked for special training to help her get over being embarrassed in a swimsuit.",
                "Saori’s sister was watching the whole time, but he didn’t know it, and she wants their sensei for herself.",
                "Now he has to deal with having two young women in his life who are very s*xually charged while trying to keep his cool as a teacher.",
                "He’s not the only one who gets into s*xual trouble, though. ",
                "The women’s tennis team wants the men’s team badly, the all-girls billiards club wants the men’s manga club, and the drama group is about to have a supreme orgy to help the cast members feel better about themselves.",
                "Every student and teacher at this “educational” institute can learn something new about how to have fun with their bodies.",
                "Every school has secrets, but not many of them leave marks that can’t be cleaned.",
                "At a certain school, there used to be a fun magic club, but now it’s all about murder and wanting power.",
                "Evil from that day was locked up and forgotten, so it stayed chained in the school’s basement.",
                "Twelve years later, Taki Minase, a high school student, goes to the scene of the crime to check it out. While there, he finds the secret written in blood: a magic book called “Black Bible.”",
                "He tries its love curses and finds out quickly that the magic is real and easily gets into the hearts and bodies of his classmates.",
                "The conversation that follows makes the students very vocal, and Minase’s actions are not ignored.",
                "What started as simple curiosity has grown into something much bigger and harder to handle.",
                "Everyone he knows, including his childhood friend Kurumi Imari, gets sucked up by the unrestrained darkness.",
                "Minase finally realizes that he has made mistakes and that he must fix them in time if he wants to get back together with Imari.",
                "And if you decide to watch this series here we have a Bible Black watch order as well check it out.",
                "Koiito Kinenbi’s two episodes feature three storylines. The protagonist and his landlord, Kanako, have a romantic story. ",
                "They’re in love and get together. Kanako’s mother (who looks younger than Kanako) goes to a hot springs resort in the first episode. ",
                "Since Kanako is drunk, they both have s*x with him. In episode 2, Kanako’s 14-year-old sister Anna visits. ",
                "There’s one more scene with the protagonist and Kanako towards the conclusion, but it’s a plot spoiler.",
                "The following narrative is between two high school drama club members. I wish this scenario was longer or continued later since it’s so fantastic.",
                "The final narrative gets two scenes in episode 2, and I’m writing this since I liked it the most. Aisha, Santa’s daughter, is giving gifts. ",
                "At the last house, she trips on the snow and smacks her head. The perverted boy thinks she’s his Christmas present and gropes and f*cks her. ",
                "She wakes up surprised as he’s inside her. She was the guy’s Christmas present and girlfriend. My favorite scene is the second. ",
                "Aisha’s sister Sasha visits and tells her mother wants grandkids. Alternatively, Sasha can do it.",
                "The only thing Rance likes more than being with beautiful women is killing them. ",
                "Rance takes odd jobs as he travels around the continent with his loyal slave Sill Plain to satisfy his insatiable libido. ",
                "Even though his s*xual urges often get him in trouble, people from all over the world praise his bravery.",
                "Rance and Sill go to the beautiful Kingdom of Leazas to help find a noble girl who has gone missing. ",
                "As they split up to follow different leads, Rance helps the people of the town with a wide range of problems, from saving a kidnapped barmaid to stopping an outbreak of zombies. ",
                "After collecting money and women, the warrior finds out about a dark secret in the kingdom that only he can stop.",
                "Keiichi Oyamada has a mysterious power that makes him seem like a lucky pervert because he always ends up sleeping with any woman he meets. ",
                "Because of this, he has never had a stable job because he keeps getting fired from the places that hire him.",
                "His best friend calls him up and asks him to work at a manga cafe, which Keiichi does not want to do. ",
                "But as soon as he starts his new job, he meets his childhood friend Kururu Hiiragi and a coworker named Rei Suzukawa. ",
                "Both of them are very pretty, and Keiichi worries that his lucky perverted powers might not protect even them.",
                "Local game design studio Flower is closing. The studio is floundering after its debut release flopped. This all-female corporation needs help finishing a new project on time.",
                "Tomoya Mochizuki loves “erogames.” He can’t write, program, or draw well. Flower’s director, Nene Sonono, hires him as a consultant due to his experience.",
                "Flower’s personnel lack s*xual experience, hence their settings and s*x scenes are shallow. ",
                "The females take a crash course in erogames to strengthen their professional talents. Under Tomoya’s watchful eye, they seek s*xual pleasure for the company’s survival.",
                "Kayoko Akizuki, who is the mother of Airi and Marina, has finally gone back to live with her husband, Kouzou. ",
                "She wants to fix things with her family because she knows her daughters have been living with only one parent for too long. ",
                "But she has no idea that Kouzou has been having s*xual relations with his two stepdaughters for a long time.",
                "As time goes on, Kayoko gets more and more curious and seems to finally be catching on to what’s going on. ",
                "When Kouzou wants to date, he gets desperate and aggressive, taking his stepdaughters while they are sleeping or in public places. ",
                "Also, a new person comes along who wants his attention, which puts Airi’s relationship with her stepfather in even more danger.",
                "A story about how each of the popular girls in high school ended up having s*x with some of the less popular guys.",
                "Each of them has their desire and lust that they can’t control. This is what we call S*x.",
                "Ichirou Tachibana’s high school years were difficult. Ichirou knows Yuuko Morino is a witch.",
                "When Lily Ramses Futaba finds Ichirou peeking at Yuuko, she uses new magic to convert him into her familiar servant.",
                "Lily’s ploy to annoy Ichirou backfires as the spell turns him into a purple tentacle monster. ",
                "Now he must obtain s*xual energy from witches to sate the tentacle monster’s lust and keep his humanity. Ichirou’s new form allows him to control the two witches to fulfill his wishes.",
                "The group also learns that Lily’s spell was ingeniously constructed to look real. Despite their s*xual mishaps, the Witches and Tentacle are pawns in a larger game.",
                "A young boy from a poor family is the main character. When he steals candy from a store in Paris, he gets caught.",
                "But after a city detective named Guildias sets him up, Guys is found guilty of murdering a man he has never met and sentenced to life in prison.",
                "From then on, most of Enzai takes place inside a dark, crowded, and dirty prison. ",
                "There, Guys go through different kinds of humiliation and torture, many of which involve s*xual acts like rape and forced sodomy.",
                "On a hospital ward that is off-limits, ",
                "the head doctor does crazy erotic experiments on the nurses, ",
                "taking away their uniforms, inhibitions, ",
                "and self-control until even he is shocked by what he finds.",
                "Somewhere, there is a forbidden mansion with erotic pleasures that can’t be put into words.",
                "Behind each door is a beautiful woman waiting to be touched by a man. ",
                "But these voluptuous vixens love pain and punishment so much that they make even the strongest beg for mercy. ",
                "Who can stand the intense pleasure and rule the harem as if it were his own?",
                "The year is now 2010. A shady group of s*xual predators known as the “Last Molester Train,” has been forced underground once again by Raven Guard, a group of militant ultra feminists. ",
                "For the past three years, Raven Guard has been putting an end to the group’s reign of s*xual predation. ",
                "But not everything is lost yet. The Last Molester Train kept looking for a savior who could bring back the glory of their patriarchy. ",
                "Finally, that man has been found.",
                "Humanity is in a very bad situation. There are a lot of women in a world where there are almost no men. There is only one man for every 10,721 women.",
                "To fix this sad situation, governments give licenses to men and encourage them to mate with girls of their choice. This is done so that the balance between the s*xes can be restored.",
                "Takumi Ibuki is the only man in his city, so he gets his license and does his job.",
                "In a place where there are only women as far as the eye can see, Takumi will do his best to save humanity, whether it’s with his school’s ace, his childhood friend, or even his sister.",
                "The story goes that humans are not the only powerful civilization on Earth. ",
                "In this world, there are two other races: the Makai, who are demons, and the Juujinkai (a half-man, half-beast race). ",
                "Once every 3,000 years, a supreme being called the “Choujin” (Overfiend) will appear and bring balance to all three realms on Earth. ",
                "In modern Japan, a Jujinkai named Amano Jyaku has found the Choujin inside a high school dropout named Tatsuo Nagumo. ",
                "This was after 300 years of searching without end. ",
                "But now, Amano, his sister Megumi, and their friend Kuroko have to protect Nagumo and his new girlfriend Akemi Ito from the Makai, who think Nagumo is not the Choujin but an evil being that wants to kill every living thing on Earth.",
                "Yuzuru and Azumi are going on a very important date tonight. ",
                "If they don’t get closer by the end of the night, their relationship may be in trouble. ",
                "Both of them are aware of how important this matter is, but they are so nervous and uncertain that they question each other’s motives.",
                "The title is a reference to the iconic Taboo film series.",
                "Misako has been Yosuke Amamiya’s wife for a year now, but her stepson Kazuhiko barely even notices her, let alone sees her as a mother figure. ",
                "But there is something more important on her mind: when she is alone at home, she often gets threatening phone calls from a stranger who knows a lot about her daily life. ",
                "She can’t talk to Yosuke about this, so she keeps quiet about these disturbing interactions.",
                "Just as Kazuhiko starts to like Misako more, she gets a s*x toy sent to her house, which makes things worse. ",
                "Since her workaholic husband doesn’t give her what she wants, she starts a new hobby: masturbating on the phone with an unknown speaker. ",
                "Misako finds out that she isn’t the only one with a dirty secret when she sees Kazuhiko putting on her underwear to feel good. ",
                "Now that she knows her stepson thinks of her as a woman, all this s*xual tension makes her wonder where it will lead.",
                "239 people found this article entertaining!",
                "Did you enjoy this article?",
                "Anime and gaming enthusiast with a passion for sharing my knowledge and insights. I've watched over 1000 anime and spent countless hours playing video games.",
                "You must be logged in to post a comment.",
                "\n\t\t\t\t\t\t\t\t\t\t\t\t\t© 2019-2023 MyOtakuWorld \nAll other assets and trademarks are property of their original owners. \nMyOtakuWorld is neither affiliated with nor endorsed any brands and trademarks on this site unless explicitly stated.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t"
            ],
            "img_links": [
                "https://myotakuworld.com/wp-content/uploads/2023/09/logo-mow.png",
                "https://myotakuworld.com/wp-content/uploads/avatars/2/5f21e31852920-bpthumb.jpg",
                "https://myotakuworld.com/wp-content/uploads/2022/09/Shoujo-Sect-1024x576.jpg",
                "https://myotakuworld.com/wp-content/uploads/2022/09/Isekai-Harem-Monogatari.jpg",
                "https://myotakuworld.com/wp-content/uploads/2022/09/Saimin-Seishidou.jpg",
                "https://myotakuworld.com/wp-content/uploads/2022/09/Maki-chan-to-Now.jpg",
                "https://myotakuworld.com/wp-content/uploads/2022/09/Resort-Boin.jpg",
                "https://myotakuworld.com/wp-content/uploads/2022/09/Itadaki-Seieki.jpg",
                "https://myotakuworld.com/wp-content/uploads/2022/01/Amakano-1-1024x576.jpg",
                "https://myotakuworld.com/wp-content/uploads/2022/01/Tamashii-Insert.jpg",
                "https://myotakuworld.com/wp-content/uploads/2022/01/Kyonyuu-Hitozuma-Onna-Kyoushi-Saimin.jpg",
                "https://myotakuworld.com/wp-content/uploads/2022/01/Baka-Dakedo-Chinchin-Shaburu-no-dake-wa-Jouzu-na-Chii-chan♡-1024x576.jpg",
                "https://myotakuworld.com/wp-content/uploads/2022/01/Koinaka.jpg",
                "https://myotakuworld.com/wp-content/uploads/2022/01/Tsumamigui-3-the-Animation-1.jpg",
                "https://myotakuworld.com/wp-content/uploads/2022/01/Dropout-anime-1-1024x576.jpg",
                "https://myotakuworld.com/wp-content/uploads/2022/01/Pretty-x-Cation-the-Animation-1-1024x576.jpg",
                "https://myotakuworld.com/wp-content/uploads/2022/01/Shoujo-Ramune.jpg",
                "https://myotakuworld.com/wp-content/uploads/2022/01/Yokosou-Sukebe-Elf-no-Mori-e-1-1024x576.jpg",
                "https://myotakuworld.com/wp-content/uploads/2022/01/Sono-Hanabira-ni-Kuchizuke-wo-Anata-to-Koibito-Tsunagi.jpg",
                "https://myotakuworld.com/wp-content/uploads/2022/01/15-Bishoujo-Hyouryuuki.png",
                "https://myotakuworld.com/wp-content/uploads/2022/01/Joshikousei-no-Koshitsuki.jpg",
                "https://myotakuworld.com/wp-content/uploads/2022/01/Bible-Black-1-1024x576.jpg",
                "https://myotakuworld.com/wp-content/uploads/2022/01/Koiito-Kinenbi-The-Animation-1.jpg",
                "https://myotakuworld.com/wp-content/uploads/2022/01/Rance-01-Hikari-wo-Motomete-The-Animation-1.jpg",
                "https://myotakuworld.com/wp-content/uploads/2022/01/Mankitsu-Happening.jpg",
                "https://myotakuworld.com/wp-content/uploads/2022/01/Eroge-H-mo-Game-mo-Kaihatsu-Zanmai.webp",
                "https://myotakuworld.com/wp-content/uploads/2022/01/Oni-Chichi-Rebuild-1.jpg",
                "https://myotakuworld.com/wp-content/uploads/2022/01/Stringendo-Angel-tachi-no-Private-Lesson-Stringendo.jpg",
                "https://myotakuworld.com/wp-content/uploads/2022/01/Tentacles-and-Witches.jpg",
                "https://myotakuworld.com/wp-content/uploads/2022/01/Enzai-Falsely-Accused-1-1024x576.jpg",
                "https://myotakuworld.com/wp-content/uploads/2022/01/Yakin-Byoutou-Night-Shift-Nurses.jpg",
                "https://myotakuworld.com/wp-content/uploads/2022/01/Waver-Behind-Closed-Doors.jpg",
                "https://myotakuworld.com/wp-content/uploads/2022/01/Saishuu-Chikan-Densha-Midnight-Sleazy-Train-1.jpg",
                "https://myotakuworld.com/wp-content/uploads/2022/01/Zettai-JunshuKyousei-Kozukuri-Kyokashou-1-1024x576.jpg",
                "https://myotakuworld.com/wp-content/uploads/2022/01/Choujin-Densetsu-Urotsukidouji.jpg",
                "https://myotakuworld.com/wp-content/uploads/2022/01/Virgin-Night-1.jpg",
                "https://myotakuworld.com/wp-content/uploads/2022/01/Enbo-Taboo-Beautiful-Mother.jpg",
                "https://myotakuworld.com/wp-content/uploads/avatars/2/5f21e31836157-bpfull.jpg",
                "https://myotakuworld.com/wp-content/uploads/2023/09/mow-icon-favicon.png"
            ]
        }
    ]
}