{
    "links": [
        "https://ru.wikipedia.org/wiki/%D0%9F%D0%B5%D1%80%D1%81%D0%BE%D0%BD%D0%B0%D0%BB%D1%8C%D0%BD%D1%8B%D0%B9_%D0%BA%D0%BE%D0%BC%D0%BF%D1%8C%D1%8E%D1%82%D0%B5%D1%80",
        "https://ru.wikipedia.org/wiki/Linux"
    ],
    "data": [
        {
            "url": "https://ru.wikipedia.org/wiki/%D0%9F%D0%B5%D1%80%D1%81%D0%BE%D0%BD%D0%B0%D0%BB%D1%8C%D0%BD%D1%8B%D0%B9_%D0%BA%D0%BE%D0%BC%D0%BF%D1%8C%D1%8E%D1%82%D0%B5%D1%80",
            "data": [
                "Персона́льный компью́тер, ПК (англ. personal computer, PC), ПЭВМ (персональная электронно-вычислительная машина) — однотерминальная однопользовательская, то есть предназначенная для использования одним пользователем ЭВМ, имеющая эксплуатационные характеристики бытового прибора и универсальные функциональные возможности. ПК может быть как стационарным (чаще всего настольным), так и переносным (ноутбук, планшет). Сравнительно редко встречаются разнообразные «ПК-чемоданы» или «ПК-рюкзаки», сочетающие в себе некоторые качества стационарного и переносного персонального компьютера.\n",
                "Согласно ГОСТ 27201-87, ПК применяются как средства массовой автоматизации (в основном для создания на их основе автоматизированных рабочих мест) в социальной и производственных сферах деятельности для различных областей народного хозяйства и предназначенные для пользователей, не обладающих специальными знаниями в области вычислительной техники и программирования.\n",
                "Как и компьютеры вообще, изначально персональный компьютер был создан как вычислительная машина, но современный ПК также используется и в других целях — как терминал для доступа в информационные сети, платформы для мультимедиа и компьютерных игр (см. игровой ПК). Также используется как персональная рабочая станция.\n",
                "В исследовательской среде долгое время шли споры о том, где именно впервые было использовано словосочетание «персональный компьютер». В итоге, в начале 2000-х, благодаря возникшей возможности автоматического поиска по оцифрованным газетам и журналам, ответ был найден. Термин «персональный компьютер» (ориг. англ «personal computer») впервые был использован в рекламе настольного калькулятора HP9100A, которая была опубликована в октябре 1964 года в различных профильных американских изданиях[1].\n",
                "В следующем, 1965, году термин «персональный компьютер» относили к компьютеру Programma 101 (1964) итальянской фирмы Olivetti[2].\n",
                "Впоследствии этот термин был перенесён на другие компьютеры. Фирма IBM включила аббревиатуру англ. PC (сокращение «personal computer») в официальное наименование своего изделия — ПК IBM PC, — в качестве центральных процессоров, в которых использовались микропроцессоры от Intel. (Впоследствии это семейство микропроцессоров и ПК и не только ПК на их базе стали известны как x86.) С распространением ЭВМ, имеющих архитектуру IBM PC, то есть ПК на архитектуре x86, в начале 1980-х годов, персональным компьютером стали называть любую ЭВМ, имеющую архитектуру IBM PC. С появлением x86-процессоров новых поколений, которые помимо Intel стали производить AMD, Cyrix (ныне VIA), а также микропроцессоров для персональных компьютеров иных архитектур (в частности PowerPC), название приобрело более широкую трактовку. При монополии Microsoft Windows англоязычная аббревиатура «PC» стала использоваться в описании драйверов и рекламе видеоигр и ОС в значении «Microsoft Windows на IBM PC-совместимом компьютере» (ср. Wintel)[3]. В тоже время, например, русскоязычные термины «персональный компьютер» (ПК), «персональная ЭВМ» (ПЭВМ) обозначают любой персональный компьютер — не только персональный компьютер на x86-процессоре.\n",
                "В Советском Союзе вычислительные машины, предназначенные для персонального использования, носили официальное название «персональные электронные вычислительные машины» (ПЭВМ). В терминологии, принятой в российских стандартах, это словосочетание и сегодня указывается вместо используемого де-факто названия «персональный компьютер»[4].\n",
                "Изначально так назывался персональный компьютер, предназначенный для применения в быту/обучения. Но в настоящее время домашним компьютером называют любой компьютер, эксплуатируемый на дому, — это, в частности, может быть как классический ПК (например игровой компьютер или персональная рабочая станция), так и домашний сервер.\n",
                "Обычно ПК ограниченной производительности, достаточной в основном для работы с офисным пакетом/электронной почтой / бухгалтерией (желательно малошумящий).\n",
                "Персональный компьютер, предназначенный в основном для компьютерных игр. Более универсальная альтернатива игровой приставке.\n",
                "Персональный компьютер, предназначенный для использования в качестве персональной программно-аппаратной платформы для различных видов инженерного проектирования, графического дизайна (например в полиграфии) или иных специальных применений. Обычно рабочие станции отличаются от прочих персональных компьютеров намного большей производительностью. Довольно часто рабочие станции собираются из тех же комплектующих, что и серверы.\n",
                "До появления первых персональных компьютеров приобретение и эксплуатация компьютеров были очень дорогостоящими, что исключало владение ими большинством частных лиц. Компьютеры можно было найти в больших корпорациях, университетах, исследовательских центрах, государственных (в том числе военных) учреждениях.\n",
                "Решающую роль в появлении персональных компьютеров сыграло изобретение в 1971 году микропроцессора, в которым в одной микросхеме реализовались все функции центрального процессора большой ЭВМ того времени. Первый микропроцессор i4004 был создан сотрудниками компании Intel. В 1974 году фирма Intel выпустила микропроцессор i8080, ставший первым по-настоящему популярным[5].\n",
                "Создание персональных компьютеров стало возможным в 1970-х годах, когда любители стали собирать свои собственные компьютеры, — иногда лишь для того, чтобы в принципе иметь возможность похвастаться таким необычным в то время техницизмом. Ранние персональные компьютеры почти не имели практического применения и распространялись очень медленно.\n",
                "Родившись в качестве жаргонизма и синонима термина «микрокомпьютер», термин «персональный компьютер» постепенно менял свою лексику. (В настоящее время термин «микрокомпьютер» также означает совсем не то, что означал во времена ранних ПК.) Так, первое поколение персональных компьютеров можно было приобрести только в виде комплекта деталей — машинокомплекта, — а иногда даже просто обыкновенной инструкции для сборки. Сама сборка, программирование и наладка системы требовали определённых специальных знаний и опыта, — в частности навыка работы с машинными кодами или языком ассемблера. Чуть позднее, когда подобные устройства стали привычны и начали продаваться готовыми, вместе с некоторым набором адаптированных программ, в обиход вошел термин «домашний компьютер».\n",
                "В 1975 году появился компьютер Альтаир 8800, — родоначальник линейки персональных компьютеров, основанных на шине S-100. Эти компьютеры, производимые разными фирмами и как готовые системы, и как наборы для сборки, основывались в основном на процессорах линейки i8080 (i8085, z80), хотя благодаря особенностям архитектуры в такой компьютер можно было вставить карту с практически любым 8- и 16-битным процессором тех лет. Многие из них работали с операционной системой CP/M. Поздние машины этой линейки, такие, например, как Z-100, использовали i8086 и были ограниченно совместимы с IBM PC, иногда даже превосходя IBM PC в производительности и возможностях. К 1985 году архитектура S-100 почти полностью вышла из употребления.\n",
                "C 1973 года как исследовательские прототипы были выпущены несколько тысяч Xerox Alto. Xerox Alto — первый персональный компьютер с графическим интерфейсом пользователи (GUI) и метафорой рабочего стола.\n",
                "В 1976 году появился компьютер Apple I.\n",
                "В 1977 году появились первые массовые персональные компьютеры: Apple II корпорации Apple Computer, TRS-80 компании Tandy и Commodore PET компании Commodore, что явилось предвестником бума всеобщей компьютеризации населения.\n",
                "В мае 1981 года в НИИ ТТ на основе К1801ВЕ1 разработана ЭВМ индивидуального пользования «Электроника НЦ-8010». Это был первый в СССР прототип персонального компьютера, причём построенный полностью на отечественных микросхемах с отечественной архитектурой, программно совместимый с отечественным семейством микро-ЭВМ «Электроника НЦ».\n",
                "В августе 1981 года IBM выпустила компьютерную систему IBM PC (фирменный номер модели IBM 5150). Полугодичный план его продаж был выполнен за месяц. Популярность IBM PC была обусловлена его открытой архитектурой, что позволяло сторонним фирмам осуществлять его ремонт, обслуживание, а также производство периферийных устройств. К 1988 году было произведено 25 миллионов IBM-совместимых ПК, но из них лишь немногим более 15 миллионов — самой IBM[5].\n",
                "В 1983 году Apple выпустила Apple Lisa, — первый персональный компьютер, использующий мышь и имевший интуитивный пользовательский графический интерфейс (GUI).\n",
                "В январе 1983 года журнал Time назвал персональный компьютер «Машиной года». По прогнозам журнала, к концу XX века во всём мире должно было быть 80 миллионов ПК. Но, как оказалось, авторы прогноза ошиблись почти вдвое, — к 2000 году в мире в эксплуатации было 140 миллионов персональных компьютеров[5].\n",
                "В январе 1983 года был представлен публике первый (в свободной продаже) персональный компьютер с графическим пользовательским интерфейсом (GUI), — Apple Lisa. Однако из-за высокой цены и некоторых иных особенностей успех машины был ограничен. Год спустя, в январе 1984 года начались продажи Apple Macintosh, ставшего первым по-настоящему массовым ПК с GUI. IBM PC доминировали в сфере конторских компьютеров, здесь их продажи были несравнимо большие вплоть до 1995 года.\n",
                "Графический интерфейс Windows был разработан, как и Mac OS, под сильным влиянием разработок GUI в PARC, но позже, — из-за чего с 1994 года Microsoft получили несколько судебных исков от[англ.] Apple Computer Inc. Дополнительным мотивом стали «феноменально успешный Start» Windows 95 и финансовые провалы Apple середины 90-х.\n",
                "В 1997 году конфликт был урегулирован внесудебно, — Билл Гейтс инвестировал в Apple, а Apple отозвали исковые обвинения в адрес Microsoft. Появление Microsoft Windows 95 добавило PC-совместимым компьютерам интерфейсных возможностей, которые ранее существовали на Macintosh и UNIX-ПК с X Window, сохраняя собственные достоинства командной строки и многозадачности. (Правда, доступность командной строки полностью сохранялась и на UNIX-ПК с X Window, тогда как многие операции системного администрирования в Microsoft Windows 95 были выполнимы только через графический интерфейс.) Ныне возможности мультимедиа доступны в каждом доме и на любой программно-аппаратной платформе.\n",
                "GNU/Linux появилась с объединением ПО проекта GNU и других проектов с появившимся в 1991 году ядром Linux, и в первую очередь как альтернатива BSD UNIX и ряду проприетарных UNIX-систем. Однако GNU изначально разрабатывалась в том числе и для использования на персональных компьютерах. В результате, например, многие университетские учреждения, использовавшие BSD UNIX на ПК, стали переходить на GNU/Linux. Сказалось то, что сохраняя достоинства BSD UNIX (в частности открытость исходных кодов), Linux лучше работала на ПК и, как и любая UNIX-подобная ОС, поддерживала GUI — в то время X Window.\n",
                "Отсутствие в то время адекватной поддержки аппаратуры, мультимедиа, высокие требования к квалификации пользователя, малое количество и сравнительная примитивность игр мешали Linux распространиться в среде обычных домашних ПК, где безраздельно господствовали Mac и Windows.\n",
                "Однако уже во второй половине 1990-х годов ситуация меняется — во всё большем количестве появляются всё более удачные и функциональные открытые игры (как портированные из других ОС, так и написанные изначально для Linux), мультимедиа-программы, офисные пакеты, аудио- и видеоредакторы и аудио- и видеоплееры, средства обработки изображений, 2D- и 3D-графические редакторы, утилиты и пр. В Linux решены (за редкими исключениями) проблемы поддержки компьютерной аппаратуры и периферии для домашних ПК. В настоящее время Linux является рекордсменом среди ПК-ориентированных ОС по количеству созданных для неё разнообразных программ.\n",
                "Ныне Linux эффективно поддерживает также профессиональную компьютерную аппаратуру, в том числе профессиональные видеоадаптеры и другое профессиональное мультимедиа-оборудование.\n",
                "Подавляющее большинство созданных для Linux программ бесплатны и открыты. Исключениями являются лишь Linux-версии ряда проприетарных профессиональных программ (Maya, CATIA, NX, Autodesk 3ds Max (начиная с выпуска 2013) и некоторые др.) и проприетарных игр (например Doom III или Cities: Skylines).\n",
                "Благодаря возможности запускать Linux-дистрибутив с LiveCD, не устанавливая его на жёсткий диск ПК и не удаляя уже имеющуюся на нём ОС (например, другой Linux-дистрибутив или Windows/Mac OS), стало возможным опробовать LiveCD-Linux-дистрибутив прежде, чем решиться установить его. Многие LiveCD-сборки Linux поддерживают широкий спектр компьютерной аппаратуры и содержат богатый набор прикладных программ. К примеру, можно смотреть видео, слушать музыку, работать в Internet, обрабатывать любые офисные документы (тексты, презентации, таблицы и др.) и даже играть в игры, запустив Linux c LiveCD.\n",
                "Как правило, единичный персональный компьютер в течение единичного сеанса работы используется только одним пользователем. То есть, например, несколько пользователей (например, в семье) могут пользоваться одним ПК только по очереди, — то есть в режиме разделения компьютерного времени. В соответствии со своим назначением, ПК обеспечивает работу наиболее часто используемого прикладного ПО, и в частности: текстовых процессоров, веб-браузеров, почтовых программ, мессенджеров, мультимедиа-программ, компьютерных игр, графических программ, сред разработки программного обеспечения и т. п. Для упрощения взаимодействия с людьми подобные программы оснащаются удобным графическим интерфейсом.\n",
                "По данным аналитической компании IDC, в 2005 году мировые поставки персональных компьютеров составили 202,7 млн штук (рост на 15,8 % по сравнению с 2004 годом).\n",
                "В 2007 году, по данным IDC, продажи персональных компьютеров в мире составили 269 млн штук (рост по сравнению с предыдущим годом на 14,3 %). Лидером по продажам ПК стала компания Hewlett-Packard (около 18,2 % всех поставок)[6].\n",
                "В 2008 году продажи персональных компьютеров в мире составили 291 млн штук[7].\n",
                "В 2009 году мировые поставки персональных компьютеров составили 308,3 млн штук[8].\n",
                "По данным Gartner, во втором квартале 2013 года продано 76 млн ПК, на 10,9 % меньше, чем во втором квартале 2012 года[9]. Уменьшение объёма продаж ПК в мире продолжается уже несколько кварталов и является наиболее долгим в истории, это связывают с растущей популярностью недорогих tablet computer[10].\n",
                "По данным аналитической компании IDC на январь 2016, продажи домашних PC в 2015-м упали до рекордно низкой отметки с 2007 года. В 2015-м в магазины по всему миру было отгружено 276 миллионов PC, что на 10,4 процента меньше по сравнению с 2014 годом[11].\n",
                "В СССР персональные электронно-вычислительные машины (ПЭВМ) начали разрабатывать в 70-х годах[12]. В этой сфере были серьёзные достижения: например, первый в мире 16-разрядный бытовой компьютер «Электроника НЦ-8010» разработан в зеленоградском НИИ Точной технологии (НИИТТ, ныне АО «Ангстрем»), гл. конструктор В. Л. Дшхунян. Этот компьютер был создан на основе оригинальной 16-разрядной однокристальной микро-ЭВМ «Электроника НЦ-80Т» (БИС К1801ВЕ1) с оригинальной архитектурой и системой команд «Электроника НЦ», с тактовой частотой 8 МГц. После нескольких модификаций бытовой компьютер, но уже с PDP-11-совместимой архитектурой в 1983 году разработан под названием «Электроника БК-0010», освоен в производстве заводом «Экситон» (г. Павловский Посад Московской обл.) Гл. конструктор от НИИТТ — А. Н. Полосин, гл. конструктор от завода «Экситон» — С. М. Косенков. Это был первый в мире промышленный 16-разрядный бытовой компьютер. Многие зарубежные домашние компьютеры тех лет выпускались на основе 8-разрядных микропроцессоров типов Zilog Z80 и MOS Technology 6502 и их аналогов с тактовой частотой 1-4 МГц[13].\n",
                "В 80-е годы были созданы и запущены в производство такие персональные компьютеры, как: «АГАТ», БК-0010, «Корвет», «Электроника МС 0511» (УКНЦ), «Электроника МС0585», «Вектор-06Ц», ПК8000, «Львов ПК-01» и многие другие. В начале 90-х годов развернулось массовое производство десятков отечественных моделей, совместимых с ZX Spectrum, которые в первой половине 90-х стали основным стандартом домашних ПК в России и других бывших республиках СССР. С середины-конца 80-х выпускались также компьютеры ЕС ПЭВМ, «Поиск», «Ассистент» и другие, совместимые с IBM PC. Кроме цифровых персональных компьютеров выпускались также аналоговые персональные компьютеры для специальных применений[14].\n",
                "В Российской Федерации производится преимущественно сборка персональных компьютеров из импортных компонентов: производители — RoverComputers, ранее Квант, КМ, и другие. Процессоры и другие электронные компоненты производятся для военных и других особых государственных нужд, хотя и в этом случае значительную долю составляет импорт. Персональные компьютеры и смартфоны, продаваемые под собственными марками известных российских торговых сетей, изготавливаются за рубежом, включая сборку.\n",
                "Первые персональные компьютеры (как и любые первые компьютеры вообще) были стационарными. Они состояли из отдельных конструктивно завершённых частей-модулей, как, например, системного блока, монитора и клавиатуры, соединённых интерфейсными кабелями с системным блоком. Это пример раздельной схемы построения ПК. Но в настоящее время также широкое распространение получили стационарные ПК-моноблоки, в которых системный блок, монитор и, нередко, другие устройства (звуковая подсистема, веб-камера, микрофон) конструктивно объединены в одно устройство, к которому подключаются мышь, клавиатуры и иная периферия.\n",
                "Раздельная схема — в противоположность моноблочной — предполагает, что ПК состоит из системного блока и разнообразных внешних, то есть конструктивно самостоятельных, устройств, подключаемых к системному блоку извне через стандартные интерфейсы (например: USB, D-Sub, DVI, FireWire, HDMI, Thunderbolt, Bluetooth). Это могут быть:\n",
                "Исторически такая схема ПК была самой первой. Она же до сих пор остаётся самой распространённой схемой стационарных ПК. Например, большинство профессиональных рабочих станций строятся по такой схеме.\n",
                "Главное достоинство раздельной схемы — сравнительно лёгкая масштабируемость. То есть в любой момент можно без особых затруднений заменить любой из компонентов ПК (например, монитор). Но обратная сторона медали — наименьшая транспортабельность и сравнительная громоздкость такого ПК. Естественно раздельная схема применяется тогда, когда главное требование к ПК — производительность и лёгкость и простота масштабирования.\n",
                "Функциональным ядром в раздельной схеме стационарного ПК, естественно, является системный блок.\n",
                "Наиболее распространены два вида конструктивной компоновки системного блока:\n",
                "Но также становятся популярными и ПК на базе стоечных («рековых») системных блоков, — такой системный блок может быть вмонтирован в специальную стойку, устроенную в компьютерном столе.\n",
                "Десктоп («настольный компьютер» в буквальном смысле слова) — стационарный компьютер, имеющий такой форм-фактор, что его удобнее располагать на столе (отсюда и применение термина «десктоп», от англ. desktop — «рабочая поверхность (письменного стола)») дома или в офисе. Раньше системные блоки такого типа обычно были широкими и места на них было достаточно для размещения на нём ЭЛТ-монитора.\n",
                "Десктопы в основном выпускаются крупными brand-name-компаниями. Многими фирмами выпускаются тонкие десктопы — слим-десктопы (slim-desktop). Естественно, тонкий десктоп эргономичнее чем классический «толстый» десктоп, так как почти не влияет на высоту установки размещаемого на нём монитора. К тому же современные ЖК-мониторы сравнительно легки и значительно снижают требования к десктопам по части веса, который они могут выдерживать без вреда для себя.\n",
                "«Башенный» системный блок — системный блок типа Tower («башня») — высокий, но вместе с тем занимает на столе мало места и стоит слева или справа от монитора. Кроме того, установленный на стол монитор, находится ниже и не заставляет пользователя задирать голову. Разумеется, если стул допускает регулировку по высоте, проблемы нет. Однако так бывает не всегда. (Ныне окончательно проблему удобной регулировки по высоте (вкупе с регулировкой по высоте стула) решают ЖК-мониторы, с регулируемым по высоте креплением на штативе. Причём штатив может быть и встроенным в стол.) Из-за уменьшения размеров и массы комплектующих также стало возможно уменьшение и размеров самих «башенных» системных блоков. В результате сначала появились системные блоки mini-tower. Появившись, mini-tower («минибашня») стали самыми распространёнными настольными системными блоками, так как:\n",
                "Со второй половины 1990-х многие детали компьютеров вновь стали увеличиваться в габаритах, и Мini-tower со временем стал для них слишком тесным. В результате ныне самый массовый настольный системный блок — middle-tower. С другой же стороны в большинстве современных компьютерных столов под столешницей оборудовано место для установки системного блока, вследствие чего системный блок не нужно ставить на столешницу стола.\n",
                "Однако в сегменте сравнительно маломощных ПК (там, где не требуется большая вычислительная мощность) миниатюризация деталей продолжилась и, вкупе с конструктивной перекомпоновкой системного блока, породила slim-tower («тонкая башня»). «Тонкая башня» ныне является наиболее распространённым компактным системным блоком башенного типа. К тому же современные «тонкие башни» и по высоте ниже «минибашен».\n",
                "Конструктивная схема стационарного ПК, в которой системный блок, монитор и, в настоящее время, микрофон, громкоговорители, веб-камера конструктивно объединены в одно устройство — моноблок. ПК-моноблок эргономичнее (занимает минимум пространства) и более привлекателен с эстетической точки зрения. Также моноблочный ПК более транспортабелен, чем стационарный ПК, построенный по раздельной схеме. С другой стороны, моноблочный ПК сложнее масштабировать и, в том числе, затруднены самостоятельные техническая модернизация и обслуживание. Например, если у моноблока сломается микрофон, то заменить его на исправный нередко возможно только в сервис-центре.\n",
                "Компактные компьютеры, содержащие все необходимые компоненты (в том числе монитор) в одном небольшом корпусе, как правило, складывающемся в виде книжки (отсюда и самое распространённое название данного класса ПК). Приспособлены для работы в дороге, на небольшом свободном пространстве. Для достижения малых размеров в них применяются специальные технологии:\n",
                "Как правило, содержат развитые средства подключения к проводным и беспроводным сетям, встроенное мультимедийное оборудование (динамики, часто, также, микрофон и веб-камеру). В последнее время вычислительная мощность и функциональность ноутбуков не сильно уступают стационарным ПК, а иногда и превосходит их. Очень компактные модели не оснащаются встроенным CD/DVD-дисководом. (Но к любому ноутбуку всегда можно подключить внешний оптический дисковод.)\n",
                "Подключая к ноутбуку внешние клавиатуру, мышь, монитор, громкоговорители, модемы, игровые устройства и иные внешние устройства ноутбук можно превратить в настольный ПК. Это можно делать вставляя ноутбук в специальный док, как это делалось ранее или напрямую (современные ноутбуки, особенно предназначенные для замены стационарных ПК в качестве рабочих станций, дают такую возможность).\n",
                "Многие современные ноутбуки оснащаются мониторами с сенсорными экранами.\n",
                "Аналогичны ноутбукам, но содержат сенсорный, то есть чувствительный к прикосновению, экран и не содержат встроенной механической клавиатуры. Ввод текста и управление осуществляются через экранный интерфейс, часто доработанный специально для удобного управления пальцами. Некоторые модели могут распознавать рукописный текст, написанный на экране.\n",
                "Чаще всего корпус не раскрывается, как у ноутбуков, а экран расположен на фронтальной стороне корпуса. Бывают и комбинированные модели, у которых корпус может тем или иным образом раскрываться (например, как слайдер), предоставляя доступ к расположенной внутри клавиатуре, или же могут снабжатся отделяемыми клавиатурами.\n",
                "По вычислительной мощи планшетные ПК уступают стационарным ПК и ноутбукам, так как для длительной работы без внешнего источника питания приходится использовать энергосберегающие комплектующие, жертвуя их быстродействием.\n",
                "Сверхпортативные ПК, умещающиеся в кармане. Управление ими, как правило, происходит с помощью небольшого по размерам и разрешению экрана, чувствительного к нажатию пальца или специальной палочки-указки — стилуса, — а клавиатура и мышь отсутствуют. Однако некоторые модели.mw-parser-output .ts-fix-template{font-style:normal;font-weight:normal;white-space:nowrap}.mw-parser-output .ts-fix-error{font-size:inherit}@media screen{.mw-parser-output .ts-fix-text{border:1px solid var(--border-color-base,#a2a9b1);box-decoration-break:clone;margin:0 -0.1em;padding:0 0.1em;transition:background 0.1s}.mw-parser-output .ts-fix-text:hover{background:#fee7e6}html.skin-theme-clientpref-night .mw-parser-output .ts-fix-text:hover{background:#4f1312}}@media screen and (prefers-color-scheme:dark){html.skin-theme-clientpref-os .mw-parser-output .ts-fix-text:hover{background:#4f1312}}@media screen and (hover:hover){.mw-parser-output .ts-fix-comment,.mw-parser-output .ts-fix-commented>a:not(:hover){border-bottom:1px dotted;text-decoration:none}}[уточнить] содержат миниатюрную фиксированную или выдвигающуюся из корпуса клавиатуру. Были популярны в начале 2000-х годов.\n",
                "Разрешение экрана стремится быть наиболее высоким, в среднем около 800×480 в современных моделях.\n",
                "В таких устройствах используются сверхэкономичные процессоры и флеш-накопители небольшого объёма, поэтому их вычислительная мощь несопоставима с другими ПК (особенно стационарными). Тем не менее, они содержат все признаки персонального компьютера: процессор, накопитель, оперативную память, монитор, операционную систему, прикладное ПО и даже игры и ориентированность на индивидуальное использование.\n",
                "КПК с функциями мобильного телефона носили название «коммуникаторы». Сейчас такие устройства называются смартфонами и, в связи с падением популярности классических КПК (в том числе вследствие проигрыша современным смартфонам в соотношении цена/функциональность), обычно рассматриваются как отдельный нишевой класс устройств. Встроенный коммуникационный модуль позволяет не только совершать звонки, но и подключаться к Интернету в любой точке, где есть сотовая связь совместимого стандарта (GSM/GPRS/3G, CDMA (для современных смартфонов также 4G).\n",
                "Barebone — компьютеры, строящиеся пользователем для выполнения определённых задач (обычно в качестве мультимедийной станции). В продажу поступают в виде так называемых «скелетных» баз («шасси») в составе корпуса, материнской платы и системы охлаждения. Материнская плата, как правило, оснащена встроенными звуковым и видеоконтроллерами. Выбор конфигурации и соответственно комплектующих в виде дисковых накопителей, памяти и периферии, а также других устройств (ТВ-тюнера, дополнительной видеокарты и т. п.) остаются на усмотрение пользователя. Часто стационарные баребоны имеют меньшую высоту корпуса и, как следствие, уменьшенный внутренний объём, а также усовершенствованную систему охлаждения, отличающуюся низкой шумностью.\n",
                "Баребоны-ноутбуки — баребон-основы для ноутбуков — обладают теми же особенностями, что и стационарные баребоны. Но есть одно «но»: конструкцией корпусов баребоны-ноутбуки не отличаются от базовых готовых ноутбуков. Как следствие, пропадают свойственные стационарным баребонам ограничения, — с поправкой на комплектующие для ноутбуков, естественно.\n",
                "Ряд компаний производит компьютеры, обладающие устойчивостью к агрессивным факторам среды эксплуатации: сильной вибрации, ударам, высоким запылённости и влажности, вандализму — условиям, в которых обычные ПК быстро бы вышли из строя. Как правило, такие ПК выпускаются в формате ноутбуков и моноблоков, более тяжёлых и больших по размерам, чем обычные. Их стоимость также значительно выше. Одна из сфер применения таких ПК — военное дело (например, эксплуатация в полевых штабах).\n",
                "Предназначены для решения задач промышленной автоматизации. Отличаются стойкостью к различным вредным внешним воздействиям, увеличенным жизненным циклом изделия, возможностью подключения к промышленным сетям (PROFINET, Profibus).\n",
                "Для использования в жилых комнатах используются конструкции ПК, производящие минимум шума или работающие совершенно бесшумно. Такие модели можно оставлять включёнными постоянно, что даёт ряд преимуществ: отсутствует период загрузки, компьютер всегда готов к работе и может постоянно отслеживать новую почту или мгновенные сообщения для пользователя. В целом, постоянно включённый ПК может выполнять ряд особенных задач:\n",
                "Чтобы сделать ПК тихим, используется несколько технологий:\n",
                "Большинство современных персональных компьютеров способны снижать потребляемую мощность и уровень шума в моменты низкой нагрузки, но для постоянной тихой работы не обойтись без применения специальных технологий, указанных выше.\n",
                "Некоторые компании предлагают ПК значительно меньших размеров, чем стандартные. Такие модели занимают меньше места в рабочей или домашней обстановке, легче вписываются в интерьер, зачастую красивее и тише обычных ПК. Собрать компактную модель по силам большинству пользователей, если подобрать специальные модели корпуса и материнской платы.\n",
                "Одними из первых компактных компьютеров были модели Macintosh в 1984 году, которые представляли собой моноблок: системные компоненты в одном корпусе с монитором. Значительно позже идея была продолжена в моделях eMac и iMac и далее в Mac Mini.\n",
                "Параллельно технологии миниатюризации отрабатывались на тонких клиентах, которые обычно невелики по размерам и весу, но полноценными ПК являлются. (Тонкий клиент — это на самом деле «умный» терминал, позволяющий, например, превратить достаточно мощный ПК в многопользовательский компьютер. Но чаще всего тонкие клиенты используются с сервером.)\n",
                "С развитием GNU/Linux и другого ПО с открытым кодом некоторые фирмы стали предлагать компактные ПК (Linutop) или комплексы на их основе (Zonbu).\n",
                "Существует несколько конкурирующих между собой проектов компактных и дешёвых в производстве персональных компьютеров, некоторые из которых предназначены для развивающихся стран: OLPC, VIA pc-1 Initiative, Classmate PC, Asus Eee PC и др. Однако удешевление и миниатюризация достигнуты ценой заметного отставания по вычислительной мощности от полноразмерных ПК.\n",
                "Технологии, уменьшающие габариты ПК:\n",
                "В настоящее время уже «компьютеры-коробочки» (например Raspberry (микрокомпьютер)) и компьютеры-флешки.\n",
                "Хакинтош (англ. hackintosh, от слов хакер или хак и макинтош) — ПК, собранный любителем и способный работать под управлением Mac OS X, во взломанном для запуска на «неяблочном» компьютере варианте называемой OSx86, то есть более дешёвый аналог компьютера от Apple. Так как современные макинтоши рассчитаны на процессоры Intel и другие стандартные компоненты, возникает принципиальная возможность запускать Mac OS X на любых ПК на базе этих процессоров. В реальности поддерживается только узкий набор аппаратных конфигураций, которые встречается в Макинтошах, поэтому «хакинтош» должен повторять одну из этих конфигураций. С другой стороны Mac OS X создана для Макинтоша и только, и корректно и максимально производительно будет работать только на Макинтоше. Кроме того, в легально поставляемой Mac OS X присутствуют ограничения, не позволяющие ей работать на чужом «железе», так что в «хакинтоше» применяют старую служебную версию без этих ограничений, либо взломанную более свежую версию, либо специальные программные средства, имитирующие сигнатуры макинтоша, проверяемые системой. Установка системы Mac OS X на компьютеры, не произведённые Apple, является также нарушением лицензии на эту ОС.\n",
                "Любой сервер, используемый неким человеком в качестве личного сервера или в качестве ПК и по этим признакам также может считаться подклассом ПК. Но конструктивно такой сервер, как любой сервер, может быть каким угодно. В частности, такой сервер может быть и стоечным.\n",
                "Конструктивно любой компьютер, используемый в качестве персональной — однопользовательской — рабочей станции и который, зачастую, ПК можно признать лишь по этому признаку. То есть конструктивно это может быть даже суперкомпьютер, но он может считаться ПК, если используется в качестве персональной рабочей станции.\n",
                "В конце 1970-х годов, после начала массового производства микросхем всё большей степени интеграции, стоимость компьютеров резко упала. Это привело к созданию компьютеров для одного человека («персональных компьютеров») вместо мейнфреймов.\n",
                "Первые персональные компьютеры всё же имели довольно большую стоимость (например, несколько тысяч долларов) и в домашних условиях применялись редко.\n",
                "В начале 1980-х годов фирмы стали производить облегчённые варианты персональных компьютеров, обычно размещаемых в клавиатурах. Эти компьютеры имели небольшую стоимость, были доступны для семей со средним достатком и ориентированы на домашнее (в том числе игровое) использование. Такие компьютеры получили общее название «домашний компьютер».\n",
                "В настоящее время подавляющее большинство продаваемых компьютеров ввиду своей функциональности и стоимости могут эксплуатироваться как на предприятиях и в конторах, так и в домашних условиях.\n",
                "Термины «ЭВМ», «персональный компьютер» и «домашний компьютер» практически полностью утратили первоначальный смысл и сливаются в более короткий и привычный термин «компьютер», который подразумевает вычислительную машину с клавиатурой, системным блоком и монитором.\n",
                "Для того, чтобы различать типологию ПК, существуют уточняющие термины: десктоп, рабочая станция, портативный (ноутбук, наколенник — лэптоп), нетбук, планшетный компьютер и так далее.\n"
            ]
        },
        {
            "url": "https://ru.wikipedia.org/wiki/Linux",
            "data": [
                "Linux (о файле/'\"`UNIQ--templatestyles-00000005-QINU`\"'ˈlɪnəks/ [ˈlɪnəks][4][5] или [ˈlɪnʊks][6][7][8], Ли́нукс; в части случаев GNU/Linux) — семейство Unix-подобных операционных систем на базе ядра Linux, включающих тот или иной набор утилит и программ проекта GNU, и, возможно, другие компоненты. Как и ядро Linux, системы на его основе создаются и распространяются в соответствии с моделью разработки свободного и открытого программного обеспечения. Linux-системы распространяются в основном бесплатно в виде различных дистрибутивов в форме, готовой для установки и удобной для сопровождения и обновлений, и имеющих свой набор системных и прикладных компонентов, как свободных, так и проприетарных.\n",
                "Появившись как решения вокруг созданного в начале 1990-х годов ядра, уже с начала 2000-х годов системы Linux являются основными для суперкомпьютеров и серверов, расширяется применение их для встраиваемых систем и мобильных устройств, некоторое распространение системы получили и для персональных компьютеров[9][10][11][12][13][14][15][16][17]. Распространение среди пользователей настольных компьютеров не столь значительное, но в 2020-е годы неуклонно растёт, достигая к 2024 году доли 4,5 %.\n",
                "За счёт использования свободного программного обеспечения и привлечения волонтёров каждая из систем Linux обладает значительными программными возможностями, трудно реализуемыми в прочих моделях разработки: например, в 2008 году расчёты показывали, что для того, чтобы «с нуля» разработать систему, аналогичную Fedora 9, потребовалось бы затратить $10,8 млрд[18], а совокупная себестоимость только ядра Linux оценивалась в сумму более $1,4 млрд, притом только за 2008 год она увеличилась на $315 млн, совокупный труд оценён в размере 73 тыс. человеко-лет[19].\n",
                "\nСемейство систем, включающих в качестве компонентов основные программы проекта GNU, такие как bash, gcc, glibc, coreutils и ряд других, иногда идентифицируется как GNU/Linux. Так как традиционно большинство систем было именно таким, под «Linux» обычно подразумеваются именно они; притом существует спор об именовании GNU/Linux. Существует проект стандартизации внутренней структуры Linux-систем — Linux Standard Base, часть документов которого зарегистрирована в качестве стандартов ISO; но далеко не все системы сертифицируются по нему, и в целом для Linux-систем не существует какой-либо общепризнанной стандартной комплектации или формальных условий включения в семейство. Однако есть ряд систем на базе ядра Linux, не имеющих в основе зависимости от программ GNU: они не могут быть названы «GNU/Linux» и их не относят к категории Linux-систем, в частности, таковы мобильные системы Android и FirefoxOS.\n",
                "Официальным логотипом и талисманом Linux является пингвин Tux, созданный в 1996 году Ларри Юингом[20]. Торговая марка «Linux» принадлежит создателю и основному разработчику ядра Линусу Торвальдсу. При этом проект Linux в широком смысле не принадлежит какой-либо организации или частному лицу, вклад в его развитие и распространение осуществляют тысячи независимых разработчиков и компаний, одним из инструментов взаимодействия которых являются группы пользователей Linux. Существует ряд некоммерческих объединений, ставящих основной целью развитие и продвижение Linux, наиболее крупное и влиятельное из них — основанный в 2007 году The Linux Foundation. Существует значительный рынок коммерческой технической поддержки Linux-систем, на котором с долей свыше 70 % (2017) доминирует корпорация Red Hat (поглощена IBM в 2019 году).\n",
                "В 1991 году во время обучения в Хельсинкском университете Линус Торвальдс заинтересовался операционными системами[21] и был разочарован лицензией MINIX, которая ограничивала её использование только образовательными целями (что исключало любое коммерческое использование), вследствие чего начал работать над своей собственной операционной системой, которая в итоге стала Linux.\n",
                "Торвальдс начал разработку ядра Linux на MINIX, и перенёс на него ряд приложений. Позже, когда Linux достиг определённой зрелости, появилась возможность продолжать разработку уже на базе самого Linux[22]. Приложения GNU вскоре заменили приложения MINIX, так как код GNU, находящийся в свободном доступе, был более удобен для применения в молодой операционной системе (исходный код под лицензией GNU GPL может быть использован в других проектах, если они также выпускаются под той же или совместимой лицензией, для того чтобы сделать Linux доступным для коммерческого использования, Торвальдс начал переходить от своей первоначальной лицензии на GNU GPL)[23]. Разработчики работали над полной интеграцией компонентов GNU в Linux с целью создания полнофункциональной и свободной операционной системы (Linux).\n",
                "Linux-системы реализуются на модульных принципах, стандартах и соглашениях, заложенных в Unix в течение 1970-х и 1980-х годов. Такая система использует монолитное ядро, которое управляет процессами, сетевыми функциями, периферией и доступом к файловой системе. Драйверы устройств либо интегрированы непосредственно в ядро, либо добавлены в виде модулей, загружаемых во время работы системы.\n",
                "Отдельные программы, взаимодействуя с ядром, обеспечивают функции системы более высокого уровня. Например, пользовательские компоненты GNU являются важной частью большинства Линукс-систем, включающей в себя наиболее распространённые реализации библиотеки языка Си, популярных оболочек операционной системы, и многих других общих инструментов Unix, которые выполняют многие основные задачи операционной системы.\n",
                "Графический интерфейс пользователя (или GUI) в большинстве систем Linux построен на основе X Window System, реже на основе более современного Wayland.\n",
                "В Linux-системах пользователи работают через интерфейс командной строки (CLI), графический интерфейс пользователя (GUI), или, в случае встраиваемых систем, через элементы управления соответствующих аппаратных средств. Настольные системы, как правило, имеют графический пользовательский интерфейс, в котором командная строка доступна через окно эмулятора терминала или в отдельной виртуальной консоли. Большинство низкоуровневых компонентов Линукс, включая пользовательские компоненты GNU, использует исключительно командную строку. Командная строка особенно хорошо подходит для автоматизации повторяющихся или отложенных задач, а также предоставляет очень простой механизм межпроцессного взаимодействия. Программа графического эмулятора терминала часто используется для доступа к командной строке с рабочего стола Linux.\n",
                "Дистрибутивы, специально разработанные для серверов, могут использовать командную строку в качестве единственного интерфейса. На настольных системах наибольшей популярностью пользуются пользовательские интерфейсы, основанные на таких средах рабочего стола как GNOME, KDE Plasma Desktop и Xfce[24], хотя также существует целый ряд других пользовательских интерфейсов. Самые популярные пользовательские интерфейсы основаны на X Window System и Wayland (однако в настоящее время идёт активный отказ от первого). X Window System предоставляет прозрачность сети и позволяет графическим приложениям, работающим на одном компьютере, отображаться на другом компьютере, на котором пользователь может взаимодействовать с ними[25].\n",
                "FVWM, Enlightenment и Window Maker — простые менеджеры окон X Window System, которые предоставляют окружение рабочего стола с минимальной функциональностью. Оконный менеджер предоставляет средства для управления размещением и внешним видом отдельных окон приложений, а также взаимодействует с X Window System. Окружение рабочего стола включает в себя оконные менеджеры как часть стандартной установки: Mutter для GNOME[26] c 2011 года[27], KWin для KDE c 2000 года[28], Xfwm для Xfce с 1998 года[29], хотя пользователь при желании может выбрать другой менеджер окон[25].\n",
                "Linux работает на множестве процессоров различных архитектур, таких как x86, x86-64, PowerPC, ARM, RISC-V, Alpha AXP, SPARC, Motorola 680x0, SuperH, IBM System/390, MIPS, PA-RISC, AXIS CRIS, Renesas M32R, Atmel AVR32, Renesas H8/300, NEC V850, Tensilica Xtensa, «Эльбрус» и многих других.\n",
                "В отличие от коммерческих систем, таких как Windows или macOS, Linux не имеет географического центра разработки. Нет и организации, которая владела бы этой системой. Linux — результат работы тысяч проектов. Некоторые из этих проектов централизованы[30][31], некоторые сосредоточены в фирмах. Многие проекты объединяют хакеров[32] со всего света, которые знакомы только по переписке. Создать свой проект или присоединиться к уже существующему может любой, и, в случае успеха, результаты работы станут известны миллионам пользователей. Пользователи принимают участие в тестировании свободных программ, общаются с разработчиками напрямую, что позволяет быстро находить и исправлять ошибки и реализовывать новые возможности.\n",
                "С другой стороны, открытый код значительно снижает себестоимость разработки закрытых систем для Linux и позволяет снизить цену решения для пользователя, в результате Linux стала платформой, часто рекомендуемой для таких продуктов, как Oracle Database, DB2, Informix, Adaptive Server Enterprise, SAP R/3, Domino.\n",
                "GNU Compiler Collection (GCC) является стандартным семейством компиляторов для большинства Linux-систем. Кроме того, GCC обеспечивает front-end для C, C++, Java. Большинство дистрибутивов включает в себя установленные интерпретаторы Bash, Perl, Python и других сценарных языков.\n",
                "Существует ряд сред для разработки (IDE): KDevelop, Eclipse, NetBeans, Lazarus, IntelliJ IDEA, Code::Blocks, Visual Studio Code и другие; также доступны и традиционные текстовые редакторы, такие как Emacs и Vim.\n",
                "Двумя распространёнными библиотеками визуальных элементов для создания графических интерфейсов пользователя являются Qt и GTK.\n",
                "В апреле 2011 года семейство операционных систем на базе ядра Linux — четвёртое по популярности в мире среди клиентов Всемирной паутины (включая мобильные телефоны). По разным данным, их популярность составляет от 1,5 до 5 %[33][34]. На рынке веб-серверов доля Linux порядка 32 % (64,1 % указаны как доля Unix)[35]. Linux используется во всех входящих в список Top500 суперкомпьютерах планеты[36].\n",
                "По состоянию на середину 2010-х годов системы Linux лидируют на рынках серверов (60 %), являются превалирующими в дата-центрах предприятий и организаций (согласно Linux Foundation), занимают половину рынка встраиваемых систем[37], имеют значительную долю рынка нетбуков (32 % на 2009 год[38]). На рынке персональных компьютеров Linux стабильно занимает 3-е место (по разным данным, от 1 до 5 %). Согласно исследованию Goldman Sachs, в целом, рыночная доля Linux среди электронных устройств составляет около 42 %[39].\n",
                "Облачные сервисы наподобие DigitalOcean предоставляют выделенные серверы разных видов Linux: Ubuntu, Debian, centOS.\n",
                "Дистрибутивы Linux уже давно используются в качестве серверных операционных систем[40] и заняли значительную долю этого рынка; по данным компании Netcraft на февраль 2014 года, семь из десяти самых надёжных интернет-компаний, предоставляющих хостинг, используют Linux на своих веб-серверах[41].\n",
                "Linux является ключевым компонентом комплекса серверного комплекта программного обеспечения LAMP (Linux, Apache, MariaDB/MySQL, Perl/PHP/Python), который приобрёл популярность среди веб-разработчиков и стал одной из наиболее распространённых платформ для хостинга веб-сайтов[42].\n",
                "Linux становится всё более популярным на мейнфреймах как благодаря удобству переноса программного обеспечения, так отчасти из-за цены[43], с конца 2009 года IBM (основной производитель мейнфреймов) добавила к линейке мейнфреймов ряд систем, поддерживающих только z/Linux[англ.][44].\n",
                "Также дистрибутивы Linux широко используются в качестве операционной системы суперкомпьютеров: по данным на ноябрь 2015, 98,8 % компьютеров из списка 500 самых мощных работали под управлением различных вариантов Linux[36]. Операционной системой самого мощного современного суперкомпьютера — Summit — является Red Hat Enterprise Linux[45][46].\n",
                "9 января 2013 года компания Valve объявила, что разрабатываемая студией ПК-консоль Steam Machine будет работать под управлением SteamOS, базирующейся на Linux[47]. Также существует возможность установки дистрибутивов Linux на некоторые игровые приставки (например, Sony PlayStation 2 (см. PlayStation 2 Linux), Sony PlayStation 3[48], Sony PlayStation 4[49], XBOX 360)[50].\n",
                "Благодаря открытому исходному коду Linux портируется на многие аппаратные архитектуры непосредственно разработчиками оборудования или разработчиками программного обеспечения для такого оборудования, что превращает Linux Embedded в мощную платформу для встраиваемых приложений на бездисковых микропроцессорных платформах с ограниченными ресурсами памяти, которые находят применение в системах автоматики, модулях сетевого оборудования, оснащённых процессорами бытовых приборах, в том числе устройств, интегрируемых в рамках концепции «интернет вещей» и «умный дом»[51].\n",
                "Из-за ограниченных ресурсов целевой платформы встроенного Linux установка средств разработки приложений на конечной платформе, как правило, исключена. Поэтому применяется кросс-разработка приложений Linux, при которой средства разработки встроенного приложения Linux устанавливаются на настольном компьютере, обычно с операционной системой Ubuntu или Debian. С помощью инструментов кросс-разработки выполняется кросс-компиляция кода приложения и удалённая отладка приложения, при которой скомпилированное приложение запускается на целевой платформе, а код анализируется программой разработки, установленной на настольном компьютере[52].\n",
                "Linux пользуются популярностью у различных государственных и муниципальных структур: Федеральное правительство Бразилии хорошо известно своей поддержкой Linux[53][54]. Правительство индийского штата Керала выпустило предписание о переходе всех школ штата на использование Linux[55][56]. Для обеспечения технологической независимости Китай использует только Linux на своих процессорах Loongson[57]. Некоторые регионы Испании разработали свои собственные дистрибутивы Linux, которые используются в образовании и госуправлении, например, такие как gnuLinEx в Эстремадуре и Guadalinex в Андалусии. Португалия также пользуется своим собственным дистрибутивом Caixa Mágica, разработанным для нетбука Magalhães[58] и государственной программы электронного образования[59]. Франция и Германия предпринимают ряд шагов по увеличению использования Linux[60].\n",
                "По заказу Минобороны России был разработан дистрибутив Линукс МСВС, который в 2002 году стал основной платформой общего назначения[61]. В 2013 году в Министерстве обороны была принята на снабжение и начала поэтапно внедряться ОС Astra Linux, а со временем планируется перевод всех служебных компьютеров и средств коммуникации ведомства на работу под её управлением[62]. Также имеет место массовое использование дистрибутива Goslinux в системе Федеральной службы судебных приставов.\n",
                "Linux ранее критиковалась за неудобство использования в настольных компьютерах, в частности, из-за ощутимой нехватки полноценных версий популярных программ (особенно офисных пакетов) и проблем с поддержкой оборудования[63], что представляло серьёзную проблему для пользователей ноутбуков, так как они обычно используют множество проприетарных комплектующих. Также проблемой являлась сложность изучения в Linux того, что выходит за рамки повседневного использования, и трудности в настройке оборудования. Более того, Linux обвиняли в «неидеальности» для многих опытных пользователей[64][65][66].\n",
                "Новые дистрибутивы Linux целенаправленно сконцентрировались на этом вопросе и значительно улучшили положение Linux среди настольных операционных систем:\n.mw-parser-output .ts-Начало_цитаты-source{margin:1em 0 0 5%}.mw-parser-output .ts-Начало_цитаты-quote .ts-oq{margin:0 -32px -8px}body.skin-minerva .mw-parser-output .ts-Начало_цитаты-quote .ts-oq{margin-left:0}.mw-parser-output .ts-Начало_цитаты-quote .ts-oq .ts-oq-header.ts-oq-header,.mw-parser-output .ts-Начало_цитаты-quote .ts-oq .ts-oq-content{padding-left:32px;padding-right:1.052632em}.mw-parser-output .ts-Начало_цитаты-quote .ts-oq .ts-oq-content{padding:8px 32px}.mw-parser-output .reference-text .ts-Начало_цитаты-quote{margin:0}\n",
                "\nLinux быстро приобрёл популярность среди малого бизнеса и домашних пользователей. В этом огромная заслуга Gutsy Gibbon (кодовое название Ubuntu 7.10 фирмы Canonical). Наряду с такими дистрибутивами, как Linspire, Mint, Xandros, OpenSUSE и gOS, Ubuntu (вместе с родственными ему Kubuntu, Edubuntu и Xubuntu) сгладил большинство острых углов Linux и отшлифовал для применения в настольных системах. Без сомнения, Gutsy Gibbon — самый стабильный, полный и дружелюбный дистрибутив Linux на сегодня. Установить и настроить его теперь проще, чем Windows.\n",
                "Рабочая среда дистрибутивов Linux не сложнее, чем Windows и OS X. Современные настольные дистрибутивы имеют графический установщик, позволяющий автоматически разбивать диск на разделы, устанавливая готовую операционную систему, оснащённую интернет-браузером, музыкальными и видеоплеерами, офисный пакет, программой просмотра документов различных форматов и т. д. Также существует механизм (программа), облегчающий установку фирменных драйверов оборудования. В наше время можно вообще обойтись без терминала, что и делают многие пользователи, а для других пользователей «использование терминала» чаще всего означает копирование команды из готовой пошаговой инструкции с помощью мыши. Уровень аппаратной поддержки очень высок, часто выше, чем в последних версиях Microsoft Windows.\n",
                "Большинство пользователей для установки Linux используют дистрибутивы, включающие не только набор программ, но и решающие ряд задач по обслуживанию, объединённых едиными системами установки, управления и обновления пакетов, настройки и поддержки.\n",
                "Самые распространённые в мире дистрибутивы (2017)[67]: Linux Mint, Ubuntu, Debian, Mageia, Fedora, OpenSUSE, ArchLinux, CentOS, PCLinuxOS, Slackware, Gentoo. Многие из дистрибутивов связаны друг с другом и в той или иной степени совместимы, в частности, Ubuntu основан на Debian, а дистрибутивы Mint основаны как на Ubuntu, так и Debian (LMDE) и полностью с ними совместимы, но при этом включают дополнительно поддержку по умолчанию Java, Adobe Flash и некоторых других проприетарных компонентов, а CentOS основан на исходных текстах коммерческого дистрибутива Red Hat Enterprise Linux (доступного в бинарной сборке только платным подписчикам) и при этом полностью бинарно совместимый с ним.\n",
                "Для многих упомянутых дистрибутивов характерна форма выпуска LiveCD, когда ОС запускается без установки с оптического диска или флеш-накопителя. Из этого состояния можно поставить систему стационарно либо работать таким образом до выключения компьютера — для этих целей существуют обособленные «мобильные» дистрибутивы, наиболее популярен из которых Knoppix. Дистрибутив Puppy Linux предназначен специально для устаревших и маломощных компьютеров.\n",
                "Отдельный класс дистрибутивов — предполагающие самостоятельную сборку всех или части компонентов из исходных кодов, предназначенные для пользователей, заинтересованных в изучении устройства Linux, среди таковых — LFS, Gentoo, CRUX.\n",
                "Существуют также дистрибутивы с региональной спецификой, например, в России создаются нацеленные в основном на внутренний рынок дистрибутивы ROSA, ALT Linux, ASPLinux (закрыт в 2011 году), НауЛинукс, Calculate Linux, Runtu, Rosinka, РЕД ОС, Astra Linux. В ФРГ существовал государственный региональный дистрибутив LiMux — «Мюнхенский Линукс».\n",
                "Microsoft пыталась критиковать Linux, развернув обширную маркетинговую кампанию «Get the Facts»[68], утверждая о большей надёжности и защищённости своего семейства операционных систем. Корпорация опубликовала различные исследования-кейсы, однако их достоверность ставится под сомнение различными авторами, заявляющими о фальсификации этих сравнений со стороны Microsoft[69].\n",
                "В частности, сравнивая количество уязвимостей, Microsoft предоставила данные об уязвимостях в различном программном обеспечении, в том числе пользовательского уровня, поставляемом в составе некоторых дистрибутивов Linux, сравнив это количество с уязвимостями только самой операционной системы Windows, который сам по себе не имеет такого количества применений и, конечно же, никогда не используется в таком «голом» виде.\n",
                "При сравнении стоимости владения Microsoft ссылается на цены на поддержку серверных решений от Red Hat Linux, приводя в пример самую дорогую подписку (Премиум-подписка, круглосуточная поддержка по телефону или через Интернет). Кроме того, при сравнении используется разное оборудование — дешёвое для Windows и дорогое для Linux.\n",
                "Эта и подобная критика кампании «Get the Facts» заставила Microsoft официально свернуть[70] её и перейти к скрытым формам агитации.\n"
            ]
        }
    ]
}