{
    "links": [
        "https://liquipedia.net/dota2/Team_Spirit"
    ],
    "data": [
        {
            "url": "https://liquipedia.net/dota2/Team_Spirit",
            "data": [
                "Team Spirit is a Russian esports organization founded in 2015.[1] In 2021, it became the second Eastern European based organization to win The International after Na'Vi. The organization has been headquartered in Belgrade, Serbia since 2022. In October 2023, it became the second team after OG to win two TIs.\n",
                "The organisation was founded in 2015 and signed its first Dota 2 roster on the 6 December 2015, by acquiring CIS Rejects.[9] The original squad consisted of RAMZES666, Iceberg, AfterLife, ALWAYSWANNAFLY, and captain Goblak. The team saw some immediate success, winning the European qualifier for MDL Winter and coming in second in the European qualifier for The Shanghai Major, thus qualifying for the second ever Valve run Major. However, results at these international LANs were disappointing, coming in last place at all of them, including StarSeries S1 (which the CIS Rejects had qualified for, prior to signing with Spirit). As a result, RAMZES666 and AfterLife departed the team and were replaced by Illidan and Funn1k. After another last place finish at an international LAN, WePlay S3, ALWAYSWANNAFLY and Illidan depart and were replaced by TI 2011 champion XBOCT and Ghostik. Sadly, these roster changes were unable to achieve positive results and the team failed to qualify for anymore LANs, even failing to beat the Open Qualifier for The International 2016. As a result, the entire roster was dropped or departed by September 2016. \n",
                "In December 2016, a new roster is announced, with Bzz, DkPhobos, fng and VANSKOR joining the team. The lineup is rounded out by the return of Iceberg. This roster had little to no notable results, failing to qualify for all international LANs. However, they narrowly missed qualifying for The International 2017, losing 0-3 to Team Empire in the grand final series of the CIS qualifier. \n",
                "For the next season, Illidan returns and is joined by G and Danish support Biver, who replace Iceberg, Bzz, and VASKOR. Despite mostly lackluster results in qualifiers, towards the end of the season, they managed to qualify for the China Dota 2 Supermajor. They were also allowed to participate at ESL One Birmingham as replacement for Natus Vincere. At ESL, they narrowly missed reaching the main event, after losing 1-2 to Fnatic in the group stage. They also managed to 2-0 Evil Geniuses, leading to their infamous roster collapse right before The International 2018. EG would take their revenge on Spirit at the Supermajor, beating them 1-2 in the first round of the lower bracket, thus another last place finish at an international LAN. They also once again failed to qualify for TI, coming in 3rd behind Espada and Winstrike Team in the CIS qualifier.\n",
                "In the following season, a new squad around Western European players is formed: fng and Biver are joined by Serbian carry oliver, German mid Nine, and Danish offlaner HesteJoe-Rotten. However, due to failing to qualify for any Majors or Minors, fng decided to depart in January 2019 and the entire roster is dropped. In May, the organization signs Old but Gold, featuring Spirit alumni Illidan, G, Bzz, and VANSKOR, as well as velheor, in preparation for The International 2019 qualifier. Sadly, the roster was not able to qualify, coming dead last in the CIS qualifier group stage. As a result, the organization drops the roster in August 2019.\n",
                "In October 2019, Team Spirit signed the roster of Positive Guys, with iLTW, Ergon, nongrata, Immersion, and captain Misha, for the upcoming DPC season. Despite some good results in online qualifiers, the team was unable to convert them to good results on LAN, finishing last place at the Chengdu Major and 5-6th place at the Bukovel Minor. With offline events cancelled for the remainder of the year, due to the coronavirus pandemic, and rather poor results in online tournaments, the members slowly trickled away: nongrata and iLTW in March, Immersion and nongrata replacement AfterLife in June, and finally iLTW's replacement DyrachYO in October. The roster was finally dropped for good in December 2020.\n",
                "On December 19 2020, the organization signed the roster of Yellow Submarine, with youngsters Yatoro, TORONTOTOKYO, and Collapse, alongside captain so bad and veteran Miposhka. Finally, the team added Dota legend Silent as coach. The team was seeded into the CIS Upper Division of the new DPC season. In early February 2021, so bad was removed from the active roster and replaced by Mira, on loan from Cascade, and Miposhka would take over captaining duties. The team would finish in 4th place in the first season of the CIS Upper Division, thus retaining their spot for season two in the Upper Division, but failing to qualify for the Singapore Major. Mira would also fully join the roster. \n",
                "In the second season of the CIS Upper Division, Team Spirit finished in second place, behind Virtus.pro, thus qualifying for the Group Stage of the WePlay AniMajor. Here, the team narrowly gets out of the group stage, by beating Team Liquid in a Bo1 tiebreaker match for the last spot in the lower bracket of the playoffs. In the first round, they were able to beat Alliance, but lost to Vici Gaming in the second, thus exiting the tournament in 7-8th place and garnering 200 DPC Points. \n",
                "With a total of 585 DPC points for the 2021 DPC Season, the team was ineligible for a direct invite to The International 2021. But all was not lost, as there would still be a chance at the Eastern European qualifiers, where Team Spirit marched through the upper bracket, meeting little opposition until the Upper Bracket Final. Here, they pulled off an impressive comeback in the deciding game 3 against Hellraisers and advanced to the Grand Final. After beating rivals Team Empire 3-2 in a nail-biting series, they secured the CIS qualifier spot at TI 2021. Together with Virtus.pro, they would be the only two CIS participants at TI this year.\n",
                "The young squad did not go into TI with many expectations on them. The untested nature of the team and the relative weakness of the CIS region had many experts predicting an early exit from the tournament, if not already after the group stage. Furthermore, a lack of any major results made estimation of their skill very difficult and leading many to underestimating them. \n",
                "The group stage of TI would start extremely poorly for them, managing to win only one out of four series and sitting in last place after the first two days. On the last two days however, they were able to avoid the looming disaster, without dropping a single map to the likes of Quincy Crew and Fnatic, and catapulting themselves to fourth place of their group and thus securing themselves a berth in the upper bracket of the main event. \n",
                "In the first game of the upper bracket, Team Spirit shocked the scene, when they took the first game off of Invictus Gaming, in an exciting upset: despite trailing in networth and kills throughout the game, the team managed rush the IG throne following a won teamfight in front of IG's high ground. This game also featured Yatoro's first of three rampages, only the sixth ever rampage at a TI main event. IG were able to take back control of the series and dropped Spirit to the lower bracket. \n",
                "In the lower bracket, Team Spirit went on an absolute tear! Sweeping first Fnatic, then two-time TI champions OG, and beating CIS rivals VP 2-1. In the fifth round of the lower bracket, the were rematched against Invictus Gaming, but this time Spirit left no doubts to anyone, eliminating IG from the tournament in a 2-0 sweep, after clawing back game 2 from poor start. The second game also featured Yatoro's second rampage of the tournament.\n",
                "The lower bracket finals, saw Team Spirit go up against one of the favorites of the tournament: Team Secret. The first map went much as everyone would expect: a dominating performance of Secret left little room for Spirit to recover and they found themselves with their backs against the wall after the first game. In an exciting second game, where Spirit were able to hold on to a small advantage for a long time, they were finally able to close out the game and equalize the series. Game three would be largely uneventful for the longest time, with Secret holding a razor thin lead for the majority of the game. On the back of Yatoro's Sven, who scored his third rampage of the tournament, a feat never achieved in TI history, Spirit were finally able to gain control of the game and defeated the heavy favorites and secured their place in the grand finals.\n",
                "In the grand finals, the undisputed favorites were waiting: PSG.LGD had only dropped two maps in the entirety of the tournament (group stage and playoffs) and were looking unstoppable. However, Team Spirit in short order doubled PSG.LGD's losses in the first two games and found themselves leading 2-0 over the championship favorites. Anyone predicting a 3-0 sweep would be proven wrong by PSG.LGD, who were able to equalize the series thanks to NothingToSay's Tinker and XinQ's Undying in games three and four, respectively. In the draft of game 5, Spirit gave PSG.LGD their signature Lycan-Tiny combo, but countered it with Collapse's signature Magnus. PSG.LGD grabbed a narrow lead, but were unable to capitalize on this and eventually missed their timings and the rest of the game was completely in Spirit's control and they did not give it up anymore, winning the grand finals 3-2 and becoming the champions of The International 2021.\n",
                "2021 - Team Spirit\nIllya \"Yatoro\" Mulyarchuk\nAlexander \"TORONTOTOKYO\" Khertek\nMagomed \"Collapse\" Khalilov\nMiroslaw \"Mira\" Kolpakov\nYaroslav \"Miposhka\" Naidenov\n",
                "The International 2021 ChampionFrom left to right:Mira, Silent, Collapse, Miposhka, TORONTOTOKYO and Yatoro.\n",
                "PGL Arlington Major 2022 ChampionFrom left to right:TORONTOTOKYO, Yatoro, Mira, Collapse, Silent and Miposhka.\n",
                "The International 2023 ChampionFrom left to right:Yatoro, Larl, Collapse, Mira and Miposhka\n",
                "PGL Wallachia Season 1 ChampionFrom left to right:Mira, Larl, Miposhka, Collapse and Yatoro\n",
                "Team Spirit at WePlay AniMajorFrom left to right:TORONTOTOKYO, Miroslaw, Miposhka, Collapse and Yatoro.\n",
                "Team Spirit at The International 2022From left to right:YATOROGOD, Collapse, Miposhka, TORONTOTOKYO, and Mira.\n",
                "Team Spirit at The International 2023\n",
                "Original logo(prior to October 5th, 2016)",
                "Second logo(prior to January 13th, 2021)",
                "Third logo(prior to January 24th, 2022)"
            ]
        }
    ]
}